[
    "With a deep blue sky over my head and a relaxing wind around me, the only thing I am missing right now is the company of you. I wish you a refreshing afternoon!",
    "With you, every part of a day is beautiful. I live every day to love you more than yesterday. Wishing you an enjoyable afternoon my love!",
    "I wish I were with you this time of the day. We hardly have a beautiful afternoon like this nowadays. Wishing you a peaceful afternoon!",
    "Time to remember sweet persons in your life, I know I will be first on the list, Thanks for that, Good afternoon my dear!",
    "Good, better, best. Never let it rest. Til your good is better and your better is best.Good Afternoon",
    "I want you when I wake up in the morning, I want you when I go to sleep at night and I want you when I relax under the sun in the afternoon!",
    "How I wish the sun could obey me for a second, to stop its scorching ride on my angel. So sorry it will be hot there. Don’t worry, the evening will soon come. I love you.",
    "Thinking of you is my most favorite hobby every afternoon. Your love is all I desire in life. Wishing my beloved an amazing afternoon!",
    "You are the cure that I need to take three times a day, in the morning, at the night and in the afternoon. I am missing you a lot right now. Good afternoon",
    "My heart craves for your company all the time. A beautiful afternoon like this can be made more enjoyable if you just decide to spend it with me. Good afternoon!",
    "Your love is like the blood cells that runs inside my veins. Your presence in life is more than a necessity for me. I love you! Good afternoon my love!",
    "Every moment of my life is enjoyable if they are spent with you. Let’s make this afternoon a memorable one together. Good afternoon, my love!",
    "In you, I have found the sweetest gift of my life. Your love makes me feel grateful to God. Good afternoon dear!",
    "I will always be there for you as long as I have a beating heart. You are my one and only. Wishing my love, a great afternoon!",
    "The best thing about this afternoon is that I have you with me to share it together. I look forward to making it a memorable one. Good afternoon!",
    "Afternoons like this makes me think about you more. I desire so deeply to be with you in one of these afternoons just to tell you how much I love you. Good afternoon my love!",
    "I have tasted things that are so sweet, heard words that are soothing to the soul, but comparing the joy that they both bring, I’ll rather choose to see a smile on your cheeks. You are sweet. I love you",
    "My wishes will always be with you, Morning wish to make you feel fresh, Afternoon wish to accompany you, Evening wish to refresh you, Night wish to comfort you with sleep, Good afternoon dear!",
    "Our love is sweeter than what I read in romantic novels and more fulfilling than I see in epic films. I couldn't have been me, without you. Good afternoon honey, I love you!",
    "Each and every day, I miss you much more, and this noon, I feel terribly bad because I won’t be able to see you as you are many miles away. I miss you. Good afternoon.",
    "I miss you every day, since you came into my life and became a part of it, and I don’t want to stay a moment without you. I wouldn’t survive without you because your love is like the air I breathe. Good afternoon.",
    "I’m giving you my heart, filled with my love for you, make sure you drain all the love before sending it back to me to fill it again with some more. I love you. Good afternoon.",
    "Your love has become a strength in me because with it, I can act in the best way I should. It has become the reason why I smile every day.",
    "You mean the world to me, and that’s the very reason why I am so concerned with making you happy, every second of your life. Good afternoon.",
    "I beseech the Lord to grant you complete rest this afternoon. It is not always easy to start the working day with a smile on our face but we just have to do so. Good afternoon.",
    "A joyful angel like you is very rare on this planet earth, thank God you belong to me, I will always cherish you"
]